Revit 2027 API
DWFExportOptions.PortraitLayout Property
Paper orientation - Portrait/Landscape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PortraitLayout { get; set; }
Public Property PortraitLayout As Boolean
	Get
	Set
public:
property bool PortraitLayout {
	bool get ();
	void set (bool value);
}
member PortraitLayout : bool with get, set
Property Value
Boolean
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace